Shubuo/SD.SPI.FATFS-Stm32F103/main.c
					Tara = Get_Tara();
								
					teste = 0;
				}
								
				if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
					while(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin));
					estado = 2;
					teste = 0;
				}
				if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
					while(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin));
					estado = 3;
					teste = 0;
				}       
			break; 
			}
			
			case 2:
			{		

				Update_RTC();
				LCD_ShowRTC();			
				
				if(teste != 1){
					LCD_LIMPA();
					ENVIA_STRING_LCD("INICIAR");
					LCD_CURSOR(1,20);
					teste = 1;
					
					
				}
				
				if(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin)){
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					LCD_LIMPA();
					ENVIA_STRING_LCD("Obtendo Tara...");
					Tara = Get_Tara();
					LCD_LIMPA();
					
					// KALMANS
					E_E0 = Tara;
								
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin) == 0){
					
						
						//aForce = ReadCount();					
						aForce = moving_average(15);											
						//aForce = FIR(16);	
						//aForce = IIR(3);	
						//aForce = Kalmans();
						Force = (aForce - Tara)*(0.00238);
						
						
						LCD_CURSOR(0,0);
						//LCD_LIMPA();
						sprintf(taux1,"Forca: %.02f",Force);						
						ENVIA_STRING_LCD(taux1);	
																	
					}while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					
					teste = 0;
					
										

         //  Inicializacao uSD				
					
//				if(SD_Init() != 0){					
//					LCD_LIMPA();
//					ENVIA_STRING_LCD("NO SD");
//					HAL_Delay(500);		
//					teste=0;
//				}
//				else{					
//					SD_Backup((Force));					
//				}						
				}
								
				if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
					while(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin));
					estado = 1;
					teste = 0;
				}       
				else if (HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
					while(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin));
					estado = 3;
					teste = 0;				
				}
			break; 
			}
			case 3:
			{				
				if(teste != 1){
					LCD_LIMPA();
					ENVIA_STRING_LCD("DATA/HORA");
					teste = 1;
				}
					
				Update_RTC();
				LCD_ShowRTC();				
				
				if(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin)){
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					LCD_LIMPA();
					ENVIA_STRING_LCD("SELECIONE:");
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
								
					do{									
									
						sprintf(taux1,"%02d:%02d %02d/%02d/%02d",horas,minutos,dia,mes,ano);
						LCD_CURSOR(1,2);	
						ENVIA_STRING_LCD(taux1);
						LCD_CURSOR(1,20);						
						
						if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
							horas += 1;							
							if(horas > 23){
								horas = 0;
							}
							sTime.Hours = horas;
							HAL_Delay(50);							
																												
						}
						
						if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
							horas -= 1;							
							if(horas< 0){
								horas = 23;
							}
							sTime.Hours = horas;
							HAL_Delay(50);
						}						
						
					}while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin) == 0);
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					
					HAL_RTC_SetTime(&hrtc,&sTime,RTC_FORMAT_BIN);
					HAL_Delay(50);
					
					do{			
						
						sprintf(taux1,"%02d:%02d %02d/%02d/%02d",horas,minutos,dia,mes,ano);
						LCD_CURSOR(1,2);	
						ENVIA_STRING_LCD(taux1);
						LCD_CURSOR(1,20);						
						
						if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
							minutos += 1;
								if(minutos > 59){
									minutos = 0;
								}							
								 
							HAL_Delay(50);
																					
						}
						
						if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
							minutos -= 1;
								if(minutos < 0){
									minutos = 59;
								}							
							HAL_Delay(50);
						}						
						
						
					}while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin) == 0);
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					
					sTime.Minutes = minutos;
					HAL_RTC_SetTime(&hrtc,&sTime,RTC_FORMAT_BIN);
					
					do{			
						
						sprintf(taux1,"%02d:%02d %02d/%02d/%02d",horas,minutos,dia,mes,ano);
						LCD_CURSOR(1,2);	
						ENVIA_STRING_LCD(taux1);
						LCD_CURSOR(1,20);						
						
						if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
							dia += 1;
							if(dia > 31){
								dia = 1;
							}							
							sDate.Date = dia;	 
							HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
							HAL_Delay(50);
																					
						}
						
						if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
								dia -= 1;
								if(dia < 1){
									dia = 31;
								}							
							sDate.Date = dia;	 
							HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
							HAL_Delay(50);
						}							
						
					}while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin) == 0);
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					
					do{			
						
						sprintf(taux1,"%02d:%02d %02d/%02d/%02d",horas,minutos,dia,mes,ano);
						LCD_CURSOR(1,2);	
						ENVIA_STRING_LCD(taux1);
						LCD_CURSOR(1,20);						
						
						if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
							mes += 1;
							if(mes > 12){
								mes = 0;
							}							
							sDate.Month = mes;	 
							HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
							HAL_Delay(50);
																					
						}
						
						if(HAL_GPIO_ReadPin(BT1_GPIO_Port,BT1_Pin)){
								mes -= 1;
								if(mes < 0){
									mes = 12;
								}							
							sDate.Month = mes;	 
							HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
							HAL_Delay(50);
						}	
						
					}while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin) == 0);
					while(HAL_GPIO_ReadPin(BT3_GPIO_Port,BT3_Pin));
					// -------------------------------------------------------------------
					do{	
						hora = horas;
						sprintf(taux1,"%02d:%02d %02d/%02d/%02d",hora,minutos,dia,mes,ano);
						LCD_CURSOR(1,2);	
						ENVIA_STRING_LCD(taux1);
						LCD_CURSOR(1,20);						
						
						if(HAL_GPIO_ReadPin(BT2_GPIO_Port,BT2_Pin)){
							ano += 1;
							if(ano > 99){
								ano = 0;
							}							
							sDate.Year = ano;	 
							HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
							HAL_Delay(50);
																					
